cases/03_h2_s6/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  www.openfoam.com
    \\  /    A nd           | Version:  v2106
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.5 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0.5 0 0);
    }
    
    outlet
    {
        type            zeroGradient;
    }
    
    wall_bottom
    {
        type            noSlip;
    }
    
    wall_top
    {
        type            noSlip;
    }
    
    fins
    {
        type            noSlip;
    }
    
    front
    {
        type            empty;
    }
    
    back
    {
        type            empty;
    }
}

// ************************************************************************* //
